# Среди четырехзначных чисел выбрать те, у которых все 4 цифры различны

for i in range(1000, 10000):
	t = i//1000%10
	s = i//100%10
	d = i//10%10
	e = i%10
	if (t != s) and (t != d) and (t != e) and (s != d) and (s != e) and (d != e):
		print(i)


# Среди двузначных чисел найти те, сумма квадратов цифр которых делится на 13

for i in range(10, 100):
	for j in range(10, 100):
		if (i*i + j*j) % 13 == 0:
			print(i, j)


# Определить, содержит ли натуральное чило N одинаковые цифры, и если да, то найти их количество

N = 22634789623

count = 0
if len(str(N)) != len(set(str(N))):
	count = len(str(N)) - len(set(str(N)))
print(count + 1)


# Найти сумму четных цифр заданного натурального числа

N = 12702

summa = 0
for i in str(N):
	if int(i) % 2 == 0:
		summa += int(i)
print(summa)


# Найти все трехзначные числа, которые при увеличении на 1 делятся на 2,
# При увеличении на 2 делятся на 3, при увеличении на 3 делятся на 4, при увеличении 
# на 4 делятся на 5

for i in range(100, 1000):
	if ((i + 1)%2 == 0) and ((i + 2)%3 == 0) and ((i + 3)%4 == 0) and ((i + 4)%5 == 0):
		print(i)



# Найти сумму целых чисел из промежутка от 1 до 200, у которых ровно 5 делителей

for i in range(1, 200):
	delit = 0
	for j in range(1, i+1):
		if i % j == 0:
			delit += 1
	if delit == 5:
		print(i)


# Дано цело число N, получить все простые делители этого числа.

a = 4123


i = 2
while i * i < a + 1 :
	if a % i == 0 :
		print(i)
	while a % i == 0 :
		a //= i
	i += 1


# Определить количество счастливых билетов в рулоне с номерами билетов от 000001 до 999999.

summa = 0
for i in range(1, 1000000):
	num1 = i//100000
	num2 = i//10000%10
	num3 = i//1000%10%10
	num4 = i//100%10%10%10
	num5 = i//10%10%10%10%10
	num6 = i%10%10%10%10
	if num1 + num2 + num3 == num4 + num5 + num6:
		summa += 1
	
print(summa)


# Найти все симметричные натуральные числа (палиндромы) из интервала от K до L.

K = 2321
L = 3123

for i in range(K, L + 1):
	if str(i) == str(i)[::-1]:
		print(int(i))
	

