# Напишите функцию, принимающую от 1 до 3 параметров - 
# целых чисел (как стандартная функция range). 
# Единственный обязательный аргумент - последнее число. 
# Если поданы 2 аргумента, то первый интерпретируется 
# как начальное число, второй - как конечное (не включительно). 
# Если поданы 3 аргумента, то третий аргумент интерпретируется как шаг. 
# Функция должна выдавать один из следующих списков:

def analog_range(b, e=None, s=1):
    if e is None:
        e = b
        b = 0
    res = []
    begin = b
    while begin != e:
        res.append(begin*begin)
        begin += s
    return res
    

print(analog_range(10))
print(analog_range(4, 10))
print(analog_range(4, 10, 2))