# Решите задачу об интернет-торговле.Несколько покупателей в 
# течении года делали покупки в интернет-магазине. 
# При каждой покупке фиксировались имя покупателя (строка)и 
# потраченная сумма (действительное число). 
# Напишите функцию, рассчитывающую для каждого 
# покупателя и выдающую в виде словаря повсем 
# покупателям (вида имя:значение) один из следующих параметров:
# 1. число покупок;



purchases = [
	('Анна', 19), ('Ирина', 130), ('Василий', 32), ('Кирилл', 11),
	('Анна', 111), ('Василий', 54), ('Владимир', 77), ('Василий', 123), 
	]

names = {}
for name in purchases:
    if name[0] not in names:
        names[name[0]] = 1
    else:
        names[name[0]] += 1
print(names)
