# Дан массив целых чисел, который может содержать повторяющиеся элементы. 
# Найти число различных элементов массива

arr = [67, 14, 4235, 1, 55, 67, 14]

new_arr = []
for i in arr:
	if i not in new_arr:
		new_arr.append(i)

print(len(new_arr))