# Определить максимальный элемент массива и его номер. Если таких элементов в массиве 
# несколько, указать тот, который в массиве встретиться первым.

arr = [3, 5, 1, 34, 346, 0, 34]

ind = 0
maximum = 0
for i in arr:
	if i > maximum:
		maximum = i
print(f'{maximum}:{arr.index(maximum)}')