def first_dishes():
    first_dishes = [
        "1) Чечевичный суп - 175 сом",
        "2) Суп с фрикадельками - 195 сом",
        "3) Сантавру - 225 сом",
        "4) Мясо по-казахски - 205 сом",
        "5) Мастава - 190 сом",
        "6) Чучвара - 200 сом",
        "7) Шорпо - 225 сом",
        "8) Щи зеленые - 210 сом",
        "9) Овощной суп - 165 сом",
        "10) Лагман - 220 сом",
        "0) Не буду заказывать."
    ]
    print(*first_dishes, sep="\n")

def second_dishes():
    second_dishes = [
        "1) Фрикасе с гарниром - 365 сом",
        "2) Бефстроганов с гарниром - 375 сом",
        "3) Куриная грудка под сливочный соус - 365 сом",
        "4) Рыба в соусе - 465 сом",
        "5) Курица в соусе - 350 сом",
        "6) Жареные манты - 200 сом",
        "7) Чейзежи с курицей - 385 сом",
        "8) Казан кебаб из форели - 410 сом",
        "9) Куурдак с голенью - 450 сом",
        "10) Бешбармак - 400 сом",
        "0) Не буду заказывать."
    ]
    print(*second_dishes, sep="\n")
        
def salads():
    salads = [
        "1) Салат Фаттуш - 395 сом",
        "2) Салат с Киноа и Форелью - 405 сом",
        "3) Салат Домашний - 165 сом",
        "4) Салат Цезарь - 375 сом",
        "5) Салат Ерофеевский - 240 сом",
        "6) Салат Мушуру - 385 сом",
        "7) Салат Восточный - 335 сом",
        "8) Салат Лянсай - 265 сом",
        "9) Салат Греческий - 315 сом",
        "10) Салат Оливье - 400 сом",
        "0) Не буду заказывать."
    ]
    print(*salads, sep="\n")

def drinks():
    drinks = [
        "1) Сoca Cola - 80 сом",
        "2) Fanta - 80 сом",
        "3) Sprite- 80 сом",
        "4) Pepsi - 90 сом",
        "5) Лимонад Черная Смородина - 270 сом",
        "6) Домашний компот - 155 сом",
        "7) Минеральная вода - 60 сом",
        "0) Не буду заказывать."
    ]
    print(*drinks, sep="\n")

def tea():
    tea = [
        "1) Байский чай - 180 сом",
        "2) Кырма чай - 110 сом",
        "3) Фруктовый чай - 140 сом",
        "4) Ташкентский чай - 150 сом",
        "5) Чай с молоком - 120 сом",
        "6) Имбирный чай - 160 сом",
        "7) Черный чай - 80 сом",
        "8) Каркаде - 150 сом",
        "9) Шиповний - 170 сом",
        "10) Иссык-Кульский чай - 180 сом",
        "0) Не буду заказывать."
    ]
    print(*tea, sep="\n")