# Найти все трехзначные числа, которые при увеличении на 1 делятся на 2,
# При увеличении на 2 делятся на 3, при увеличении на 3 делятся на 4, при увеличении 
# на 4 делятся на 5

for i in range(100, 1000):
	if ((i + 1)%2 == 0) and ((i + 2)%3 == 0) and ((i + 3)%4 == 0) and ((i + 4)%5 == 0):
		print(i)