# Найти все симметричные натуральные числа (палиндромы) из интервала от K до L.

K = 2321
L = 3123

for i in range(K, L + 1):
	if str(i) == str(i)[::-1]:
		print(int(i))
	