# Дано цело число N, получить все простые делители этого числа.

a = 4123


i = 2
while i * i < a + 1 :
	if a % i == 0 :
		print(i)
	while a % i == 0 :
		a //= i
	i += 1
